#include <iostream>
#include <string>
using namespace std;

int main()
{
    /*
    двусвязный список схож с односвязным
    их исопльзование зависит от задачи
    двусвязный чуть быстрее засчет своего двунаправленного взаимодестивия 
    писать их постоянно не обязательно, тк есть библиотека STL


    бинарное дерево - упорядочная структура данных для быстрого поиска элемента (бинарный поиск)
    тк у списков всегда бы пришлось искать либо сначала(односвязный), либо с конца (двусвязный)
    у родителя мб только два потомка, если потомков нет,
    то такие элементы называются литьями
    слева всегда значение меньше корня, справа всегда больше
                50
            45       55
        1     49    51   
         30  46       53
    элемент дерева это индекс, под которым лежат данные
    индекс всегда должен быть уникальным
    */
    return 0;
}